LinkedFolder/TrainSet55G36U3_2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          130;
        startFace       15593;
    }
    outlet
    {
        type            patch;
        nFaces          640;
        startFace       15723;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          260;
        startFace       16363;
    }
    topbottomsurface
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2304;
        startFace       16623;
    }
)

// ************************************************************************* //
